Revit 2027 API
PulldownButtonData Constructor
Constructs a new instance of PulldownButtonData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PulldownButtonData(
	string name,
	string text
)
Public Sub New (
	name As String,
	text As String
)
public:
PulldownButtonData(
	String^ name,
	String^ text
)
new :
        name : string *
        text : string -> PulldownButtonData
Parameters
name String
The internal name of the new button.
text String
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for one or more arguments.
ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
Reference
PulldownButtonData Class
Autodesk.Revit.UI Namespace